app/Http/Helpers.php

select * from `messages` where `read_at` is null order by `created_at` desc
---
    public static function messageList()
    {
        return Message::whereNull('read_at')->orderBy('created_at', 'desc')->get();

select sum(`quantity`) as aggregate from `carts` where `user_id` = 2
---
    public static function cartCount($user_id=''){

        if(Auth::check()){
            if($user_id=="") $user_id=auth()->user()->id;
            return Cart::where('user_id',$user_id)->sum('quantity');

select sum(`amount`) as aggregate from `carts` where `user_id` = 2
---
    public static function totalCartPrice($user_id=''){
        if(Auth::check()){
            if($user_id=="") $user_id=auth()->user()->id;
            return Cart::where('user_id',$user_id)->sum('amount');

select * from `shippings` where `shippings`.`deleted_at` is null order by `id` desc
---
    public static function shipping(){
        return Shipping::orderBy('id','DESC')->get();