app/Http/Controllers/User/CartController.php

select * from `products` where `products`.`id` in (1) and `products`.`deleted_at` is null
---
    public function index()
    {
        $cart = Cart::with(['product', 'product.productPhotosPrimary'])->where('user_id', auth()->user()->id)->where('order_id', NULL)->get();