app/Http/Controllers/User/PagesController.php

select * from `product_categories` where `status` = 'active' and `is_parent` = 1 and `product_categories`.`deleted_at` is null order by `name` asc
---
    public function home()
    {
        $featured   = Product::where('status', 'active')->where('is_featured', 1)->orderByDesc('price')->limit(2)->get();
        $banners    = Banner::where('status', 'active')->latest()->limit(3)->get();
        $products   = Product::with('productPhotosPrimary')->active()->latest()->limit(8)->get();
        $category   = ProductCategory::where('status', 'active')->where('is_parent', 1)->orderBy('name')->get();