app/Http/Controllers/User/PagesController.php

select * from `products` where `status` = 'active' and `is_featured` = 1 and `products`.`deleted_at` is null order by `price` desc limit 2
select * from `posts` where `status` = 'active' order by `created_at` desc limit 3
select * from `banners` where `status` = 'active' order by `created_at` desc limit 3
select * from `products` where `status` = 'active' order by `created_at` desc limit 8
select * from `categories` where `status` = 'active' and `is_parent` = 1 order by `title` asc
---
    public function home()
    {
        $featured   = Product::where('status', 'active')->where('is_featured', 1)->orderByDesc('price')->limit(2)->get();
        $posts      = Post::where('status', 'active')->latest()->limit(3)->get();
        $banners    = Banner::where('status', 'active')->latest()->limit(3)->get();
        $products   = Product::where('status', 'active')->latest()->limit(8)->get();
        $category   = Category::where('status', 'active')->where('is_parent', 1)->orderBy('title')->get();