app/Http/Controllers/User/ProductDetailController.php

    public function __invoke($slug)
    {
        $product = Product::with('productPhotos')->where('slug', $slug)->first();
---
select * from `products` where `slug` = 'cek' and `products`.`deleted_at` is null limit 1