app/Http/Controllers/User/ProductIndexController.php

select * from `product_categories` where `parent_id` is not null and `product_categories`.`parent_id` in (1) and `product_categories`.`deleted_at` is null
select max(`price`) as aggregate from `products` where `products`.`deleted_at` is null
---
    public function __invoke(Request $request)
    {
        $categories         = ProductCategory::with('child')->parent()->active()->get();
        $maxProductPrice    = Product::max('price');