app/Http/Controllers/CartController.php

select * from `products` where `slug` = 'cek' and `products`.`deleted_at` is null limit 1
---
    public function singleAddToCart(Request $request){
        $request->validate([
            'slug'      =>  'required',
            'quant'      =>  'required',
        ]);
        // dd($request->quant[1]);


        $product = Product::where('slug', $request->slug)->first();