app/Models/Product.php

    public static function boot()
    {
        parent::boot();

        static::creating(function ($model) {
            $slug   = Str::slug($model->name);
            $count  = static::whereRaw("slug RLIKE '^{$slug}(-[0-9]+)?$'")->count();

            $model->slug = $count ? "{$slug}-{$count}" : $slug;
        });
---
select count(*) as aggregate from `products` where slug RLIKE '^cek(-[0-9]+)?$' and `products`.`deleted_at` is null