app/Http/Controllers/Admin/AddToCartController.php

select * from `carts` where `user_id` = 1 and `product_id` = 1 limit 1
---
    public function __invoke(Request $request)
    {
        if (empty($request->slug)) {
            request()->session()->flash('error','Produk tidak ditemukan');
            return back();
        }

        $product = Product::active()->where('slug', $request->slug)->first();
        if (empty($product)) {
            request()->session()->flash('error','Produk tidak ditemukan');
            return back();
        }

        //if already
        $already_cart = Cart::where('user_id', auth()->user()->id)->where('product_id', $product->id)->first();