app/Http/Controllers/Admin/OrderNewController.php

    public function __invoke(Request $request)
    {
        if($request->ajax()) {
            $data = Order::with('user')->where('status', 'new')->get();
---
select * from `orders` where `status` = 'new'
select * from `users` where `users`.`id` in (2) and `users`.`deleted_at` is null