app/Http/Controllers/Admin/ProductCategoryController.php

    public function index(Request $request)
    {
        if($request->ajax()) {
            $data = ProductCategory::with(['parent', 'createdBy', 'product'])->orderBy('parent_id')->get();

            return Datatables::of($data)
                ->addIndexColumn()
                ->addColumn('parent_id', function ($row) {
                    if ($row->parent_id === NULL) {
                        return '-';
                    } else {
                        return '<span class="badge badge-warning">'.$row->parent->name.'</span>';
                    }
                })
                ->addColumn('photo', function ($row) {
                    if ($row->photo) {
                        return '<img src="'.$row->photo .'" class="img-circle" alt="User Image" style="height: 30px; width: 30px;">';
                    } else {
                        return '-';
                    }
                })
                ->addColumn('totalProduct', function ($row) {
                    return $row->product->count();
                })
                ->addColumn('created_by', function ($row) {
                    return $row->createdBy->name;
---
select * from `product_categories` where `product_categories`.`id` in ('') and `product_categories`.`deleted_at` is null
select * from `product_categories` where `product_categories`.`deleted_at` is null
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null