app/Http/Controllers/Admin/SettingController.php

select * from `settings` limit 1
---
    public function index()
    {
        $data = Settings::first();