app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        if($request->ajax()) {
            $data = User::where('role', 'user')->get();
---
select * from `users` where `role` = 'user' and `users`.`deleted_at` is null

    public function store(UserStoreRequest $request)
    {
        $data               = $request->all();
        $data['password']   = bcrypt($request->password);
        User::create($data);
---
insert into `users` (`name`, `email`, `password`, `photo`, `status`, `updated_at`, `created_at`) values ('cek@mail.con', 'cek1@mail.com', '$2y$10$TqPG3nPb57gfSx9qrZj2ZOimqAomQK.nnG5Jrd90/feQUm953MfIu', '', 'active', '2022-05-31 04:12:03', '2022-05-31 04:12:03')