app/Http/Controllers/Admin/UserAdminController.php

    public function index(Request $request)
    {
        if($request->ajax()) {
            $data = User::where('role', 'admin')->get();
---
select * from `users` where `role` = 'admin' and `users`.`deleted_at` is null